In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./data/vehicle_prod.csv')

In [3]:
df

  Unnamed: 0   2007   2008   2009   2010   2011
0      China   7.71   7.95  11.96  15.84  16.33
1         EU  19.02  17.71  15.00  16.70  17.48
2         US  10.47   8.45   5.58   7.60   8.40
3      Japan  10.87  10.83   7.55   9.09   7.88
4      Korea   4.04   3.78   3.45   4.20   4.62
5     Mexico   2.01   2.05   1.50   2.25   2.54

In [5]:
df.rename(columns={'Unnamed: 0': 'Country'},inplace=True)
df.set_index('Country', inplace=True)
df

          2007   2008   2009   2010   2011
Country
China     7.71   7.95  11.96  15.84  16.33
EU       19.02  17.71  15.00  16.70  17.48
US       10.47   8.45   5.58   7.60   8.40
Japan    10.87  10.83   7.55   9.09   7.88
Korea     4.04   3.78   3.45   4.20   4.62
Mexico    2.01   2.05   1.50   2.25   2.54

In [6]:
df[['2007']]

          2007
Country
China     7.71
EU       19.02
US       10.47
Japan    10.87
Korea     4.04
Mexico    2.01

In [ ]:
#리스트로꺼내기
df.columns.tolist

In [ ]:
#상관분석관계
변수들간의값의변화의유사도
음의상관관계
양의상관관계